src/InformationRegisters/инкКадроваяИсторияСотрудников/инкКадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкКадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидРабочейНедели</name>
    <type>
      <types>EnumRef.инкВидРабочейНедели</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.инкВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </resources>
  <resources>
    <name>ИндивидуальныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </resources>
  <resources>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкТабельУчетаРабочегоВремени/инкТабельУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкТабельУчетаРабочегоВремени</name>
  <resources>
    <name>ВДнях</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВЧасах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/инкТабельСервер/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить данные табеля на сервере
//
// Параметры:
//  ИсходныеДанные	 - Структура 		- Содержит параметры для запроса
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные табеля 
//
Функция ПолучитьДанныеТабеляНаСервере(ИсходныеДанные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация,
		|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
		|	КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия
		|ПОМЕСТИТЬ втСотрудники
		|ИЗ
		|	РегистрСведений.инкКадроваяИсторияСотрудников.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Подразделение = &Подразделение) КАК КадроваяИсторияСотрудниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	инкТабельУчетаРабочегоВремени.Сотрудник КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(инкТабельУчетаРабочегоВремени.День, ДЕНЬ) КАК Дата,
		|	инкТабельУчетаРабочегоВремени.ВДнях КАК ВДнях,
		|	инкТабельУчетаРабочегоВремени.ВЧасах КАК ВЧасах
		|ПОМЕСТИТЬ втПроизводственныйКалендарь
		|ИЗ
		|	РегистрСведений.инкТабельУчетаРабочегоВремени КАК инкТабельУчетаРабочегоВремени
		|ГДЕ
		|	инкТабельУчетаРабочегоВремени.День МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПроизводственныйКалендарь.Сотрудник КАК Сотрудник,
		|	втПроизводственныйКалендарь.Сотрудник.Наименование КАК СотрудникНаименование,
		|	втПроизводственныйКалендарь.Дата КАК Дата,
		|	втПроизводственныйКалендарь.ВДнях КАК ВДнях,
		|	втПроизводственныйКалендарь.ВЧасах КАК ВЧасах
		|ИЗ
		|	втПроизводственныйКалендарь КАК втПроизводственныйКалендарь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудники КАК втСотрудники
		|		ПО втПроизводственныйКалендарь.Сотрудник = втСотрудники.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникНаименование";
	

	инкОбщийСервер.УстановитьПараметрВЗапросе("Организация","Организация = &Организация",ИсходныеДанные,Запрос);
	инкОбщийСервер.УстановитьПараметрВЗапросе("Подразделение","Подразделение = &Подразделение",ИсходныеДанные,Запрос);

	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(ИсходныеДанные.МесяцНачисления));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(ИсходныеДанные.МесяцНачисления));
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз; 
	
КонецФункции

// Функция - Формирует структуру для получения данных табеля. См. ПолучитьДанныеТабеляНаСервере
// 
// Возвращаемое значение:
//  Структура - Данные для табеля;
//
Функция ПолучитьСтруктуруДляДанныхТабеля() Экспорт 
	
	стр = Новый Структура;
	стр.Вставить("Организация");
	стр.Вставить("Подразделение");
	стр.Вставить("МесяцНачисления");
	                         
	Возврат стр;
	
КонецФункции

// Функция - Получить табель таблица
//
// Параметры:
//  ИсходныеДанные	 - Структура	 - Содержит период и ссылку на сотрудника
// 
// Возвращаемое значение:
//   ТаблицаЗначений - Данные по табелю за период
//
Функция ПолучитьТабельТаблица(ИсходныеДанные) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкТабельУчетаРабочегоВремени.Сотрудник КАК Сотрудник,
		|	инкТабельУчетаРабочегоВремени.День КАК День,
		|	инкТабельУчетаРабочегоВремени.Месяц КАК Месяц,
		|	инкТабельУчетаРабочегоВремени.ВДнях КАК ВДнях,
		|	инкТабельУчетаРабочегоВремени.ВЧасах КАК ВЧасах
		|ИЗ
		|	РегистрСведений.инкТабельУчетаРабочегоВремени КАК инкТабельУчетаРабочегоВремени
		|ГДЕ
		|	инкТабельУчетаРабочегоВремени.День МЕЖДУ &Дата1 И &Дата2
		|	И инкТабельУчетаРабочегоВремени.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Дата1", ИсходныеДанные.Дата1);
	Запрос.УстановитьПараметр("Дата2", ИсходныеДанные.Дата2);  
	
	Если НЕ инкОбщийКлиентСервер.ЕстьСвойство(ИсходныеДанные,"Сотрудник") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"инкТабельУчетаРабочегоВремени.Сотрудник = &Сотрудник","Истина");	
	Иначе
		Запрос.УстановитьПараметр("Сотрудник", ИсходныеДанные.Сотрудник); 	
	КонецЕсли;
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз;
	
КонецФункции            

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
